tutorials/heatTransfer/chtMultiRegionFoam/windshieldDefrost/0.org/exterior/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0.0001/exterior";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 260;

boundaryField
{
    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 260;
        value           uniform 260;
    }
    symmetry
    {
        type            symmetryPlane;
    }
    exterior_to_ice
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           uniform 260;
        Tnbr            T;
        kappa           fluidThermo;
        kappaName       none;
    }
}


// ************************************************************************* //
