tutorials/heatTransfer/chtMultiRegionFoam/windshieldDefrost/system/ice/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

iceZone
{
    type            enthalpyPorositySource;
    active          on;
    selectionMode   all;
//    cellZone        iceZone;

    enthalpyPorositySourceCoeffs
    {
        Tmelt           273;
        L               334000; // enthalpy of fusion for water [J/kg]
        thermoMode      thermo; // retrieve thermo properties from themo model
        beta            50e-6;  // thermal expansion coeff [1/K]

        rhoRef          1000;
    }
}

// ************************************************************************* //
